# JobClassC

Написать программу, которая анализирует данные о возрасте и относит человека к одной из четырех групп: дошкольник, школьник, рабочий, пенсионер.

дошкольник <= 6
 7 <= школьник <= 18
19 <= рабочий <= 59
пенсионер >= 60

Входные данные:
Одно целое число -- возраст человека.

Выходные данные: 
Одно слово. Название категории, к которой относится человек.

#include <stdio.h>
#include <string.h>
#include <math.h>
#include <locale.h>



int main() 
{
	setlocale(LC_ALL, "Rus");		
  int age;
  scanf("%d", &age);


  if (age <= 6) 
  {
      printf("Дошкольник");
  }
  if (age >= 7 && age < 19)
  {
      printf("Школьник");
  }
  if (age >= 19 && age <60)
  {
	  printf("Рабочий");
  }
  else
  {
	  printf("Пенсионер");
  }
    return 0;
}

